swat-dp-tools/soma/xml/password-alias-add.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <dp:request domain="@domain.name@" xmlns:dp="http://www.datapower.com/schemas/management">
      <dp:do-action>
        <AddPasswordMap>
          <AliasName>@password.alias.name@</AliasName>
          <Password>@password.alias.secret@</Password>
        </AddPasswordMap>
      </dp:do-action>
    </dp:request>
  </soapenv:Body>
</soapenv:Envelope>